Repository: SailScores/SailScores
Catalog: SailScores.Web/Resources/Resources.SharedResource.*.resx
Languages: fi_fi, sv_fi

source: All Races
fi_fi: Kaikki purjehdukset

source: All Series
fi_fi: Kaikki sarjat
sv_fi: Alla serier

source: Boat
fi_fi: Vene
sv_fi: Båt

source: Boat Name
fi_fi: Veneen nimi
sv_fi: Båt namn

source: Club Web Site
fi_fi: Seuran kotisivut
sv_fi: Klubbens hemsida

source: Competitor
fi_fi: Kilpailija
sv_fi: Tävlande

source: competitors
fi_fi: kilpailijat
sv_fi: tävlande

source: discards
fi_fi: poisheitot
sv_fi: borträknade

source: Helm
fi_fi: Kippari
sv_fi: Skeppare

source: Log in
fi_fi: Kirjaudu
sv_fi: Logga in

source: Name
fi_fi: Nimi
sv_fi: Namn

source: No Competitors
fi_fi: Ei kilpailijoita
sv_fi: Inga deltagare

source: No races
fi_fi: Ei lähtöjä
sv_fi: Inga starter

source: No recent series found.
fi_fi: Ei tuoreita tuloksia
sv_fi: Inga färska resultat

source: Place
fi_fi: Sijoitus
sv_fi: Placering

source: Races
fi_fi: Purjehdukset
sv_fi: Seglingar

source: races sailed with
fi_fi: kisaa purjehdittu joista
sv_fi: Starter seglade med

source: Recent Races
fi_fi: Viimeisimmät kilpailut
sv_fi: Senaste tävlingar

source: Recent Series
fi_fi: Viimeisimmät sarjat
sv_fi: Senaste serier

source: Sail
fi_fi: Purje
sv_fi: Segel

source: Sail Number
fi_fi: Purje numero
sv_fi: Segelnummer

source: Series
fi_fi: Sarjat
sv_fi: Serier

source: Total
fi_fi: Yhteistulos
sv_fi: Totalt

source: Upcoming Races
fi_fi: Tulevt kilpailut
sv_fi: Kommande tävlingar

source: Admin Page
fi_fi: Ylläpitäjä sivu
sv_fi: Administratörs sida

source: New Competitor
fi_fi: Uusi osallistuja
sv_fi: Ny tävlande

source: New Race
fi_fi: Uusi kilpailu
sv_fi: Ny segling

source: Scores
fi_fi: Tulokset
sv_fi: Resultat

source: Log out
fi_fi: Kirjaudu ulos
sv_fi: Logga ut

source: CapCompetitors
fi_fi: Kilpailijat
sv_fi: Tävlande

source: Results
fi_fi: Tulokset
sv_fi: Resultat

source: No results posted
fi_fi: Ei tuoreita tuloksia
sv_fi: Inga färska resultat

source: Change
fi_fi: Muutos

source: Previous Day
fi_fi: edelliseen päivään

source: Previous Race
fi_fi: edelliseen kilpailuun

source: Previous Week
fi_fi: edelliseen viikkoon

source: Rank change from
fi_fi: Verrattuna

source: Updated
fi_fi: Päivitetty
sv_fi: Uppdaterad

source: New Series
fi_fi: Uusi Sarjat

source: No recent races found.
sv_fi: Inga färska resultat

source: Regattas
sv_fi: Regattor

source: boats
sv_fi: båtar

source: String
sv_fi: Konkurrenter
