Repository: SailScores/SailScores
Catalog: SailScores.Web/Resources/SharedResource.*.resx
Languages: fi_fi

source: Race
fi_fi: Kilpailu

source: Scores
fi_fi: Tulokset

source: New Race
fi_fi: Uusi kilpailu

source: Edit Club Info
fi_fi: Muokkaa seuran tietoja

source: Club Web Site
fi_fi: Seuran verkkosivusto

source: Scheduled for
fi_fi: Suunniteltu päivälle

source: Abandoned
fi_fi: Keskeytetty

source: Helm
fi_fi: Ohjaaja

source: Sail
fi_fi: Purjenumero

source: Boat
fi_fi: Vene

source: Stats
fi_fi: Tilastot
